tap "finestructure/tap"
tap "grishka/grishka"
tap "homebrew-ffmpeg/ffmpeg", trusted: true
tap "jetbrains/junie", trusted: true
tap "jundot/omlx", "https://github.com/jundot/omlx"
tap "nikitabobko/tap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Swiss-army knife for Android testing and development
brew "adb-enhanced"
# Next-gen compiler infrastructure
brew "llvm"
# American Fuzzy Lop++
brew "afl++"
# Core application library for C
brew "glib"
# Low-level library for pixel manipulation
brew "pixman"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Backend processor for BibLaTeX
brew "biber"
# Object-file caching compiler wrapper
brew "ccache"
# Anti-virus software
brew "clamav"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Static analysis of C and C++ code
brew "cppcheck"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Library for USB device access
brew "libusb"
# USB programmer
brew "dfu-util"
# Load/unload environment variables based on $PWD
brew "direnv"
# .NET Core
brew "dotnet"
# YAML Parser
brew "libyaml"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Git extension for versioning large files
brew "git-lfs"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# SDL2 compatibility layer that uses SDL3 behind the scenes
brew "sdl2-compat"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg", args: ["with-webp", "with-xvid"]
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Development framework for multimedia applications
brew "gstreamer"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Cross-platform Java Version Manager
brew "jabba"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Sane PBXProj files
brew "kin"
# Anti-bikeshedding Kotlin linter with built-in formatter
brew "ktlint"
# Simple terminal UI for git commands
brew "lazygit"
# Sophisticated file transfer program
brew "lftp"
# Postgres C API library
brew "libpq", link: true
# General purpose TCP-IP emulator
brew "libslirp"
# LTeX+ Language Server: maintained fork of LTeX Language Server
brew "ltex-ls-plus"
# Utility for directing compilation
brew "make"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Message broker implementing the MQTT protocol
brew "mosquitto"
# Open source relational database management system
brew "mysql-client"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@17"
# Development kit for the Java programming language
brew "openjdk@21"
# Tools and libraries for smart cards
brew "opensc"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Minimal dumb-terminal emulation program
brew "picocom"
# Draw UML diagrams
brew "plantuml"
# Generate podman quadlet files from a podman command or compose file
brew "podlet"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# Sound system for POSIX OSes
brew "pulseaudio"
# Python version management
brew "pyenv"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Display and control your Android device
brew "scrcpy"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Shell Script Compiler
brew "shc"
# Work with remote images registries
brew "skopeo"
# SOcket CAT: netcat on steroids
brew "socat"
# Audio processing library
brew "sound-touch"
# Cross-shell prompt for astronauts
brew "starship"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Tool for managing your YubiKey configuration
brew "ykman"
# Command-line tool for the YubiKey PIV application
brew "yubico-piv-tool"
# General-purpose lossless data-compression library
brew "zlib"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Play, record, convert, and stream audio and video
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: ["with-webp", "with-xvid"]
# Android SDK component
cask "android-platform-tools"
# Network scanner
cask "angry-ip-scanner"
# Electronics prototyping platform
cask "arduino-ide"
# Utility improving 3rd party mouse performance and functionalities
cask "bettermouse"
# Web security testing toolkit
cask "burp-suite"
# Slicer and cloud services for some Creality FDM 3D printers
cask "creality-print"
# Visually compare and merge files
cask "diffmerge"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# 3D parametric modeller
cask "freecad"
# Web browser
cask "google-chrome"
# Hex editor for reverse engineers
cask "imhex"
# JetBrains tools manager
cask "jetbrains-toolbox"
# GPU-based terminal emulator
cask "kitty"
# CAD application
cask "librecad"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Connect to your Android devices
cask "macdroid"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Mesh processing system
cask "meshlab"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
cask "mqtt-explorer"
# Desktop sync client for Nextcloud software products
cask "nextcloud-vfs"
# Command-line tools for Nordic nRF Semiconductors
cask "nordic-nrf-command-line-tools"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Programmable solid 3D CAD modeller
cask "openscad"
# Collaboration platform for API development
cask "postman"
# Client for Proton Drive
cask "proton-drive"
# VPN client focusing on security
cask "protonvpn"
# HTTP debugging proxy
cask "proxyman"
# G-code generator for 3D printers (RepRap, Makerbot, Ultimaker etc.)
cask "prusaslicer"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Software and Documentation pack for Segger J-Link debug probes
cask "segger-jlink"
# Software and Documentation pack for Segger Ozone J-Link debugger
cask "segger-ozone"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@8"
# LaTeX editor
cask "texifier"
# Customizable email client
cask "thunderbird"
# Multimedia player
cask "vlc"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Network protocol analyzer
cask "wireshark-app"
# Collect, organise, cite, and share research sources
cask "zotero"
vscode "anweber.vscode-httpyac"
vscode "davidanson.vscode-markdownlint"
vscode "ddorch.codium-devcontainer"
vscode "dreamcatcher45.podmanager"
vscode "efoerster.texlab"
vscode "esbenp.prettier-vscode"
vscode "espressif.esp-idf-extension"
vscode "foxundermoon.shell-format"
vscode "hangxingliu.vscode-systemd-support"
vscode "james-yu.latex-workshop"
vscode "jeanp413.open-remote-ssh"
vscode "jebbs.plantuml"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "jeffersonqin.latex-snippets-jeff"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "lordimmaculate.platformio-ide"
vscode "ltex-plus.vscode-ltex-plus"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mjpvs.latex-previewer"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.hexeditor"
vscode "phil294.git-log--graph"
vscode "philosowaffle.openapi-designer"
vscode "pinage404.bash-extension-pack"
vscode "redhat.vscode-xml"
vscode "repreng.csv"
vscode "rpinski.shebang-snippets"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sndst00m.vscode-native-svg-preview"
vscode "sr-team.clang-tidy-sr-team-fork"
vscode "tecosaur.latex-utilities"
vscode "timonwong.shellcheck"
vscode "torn4dom4n.latex-support"
vscode "waderyan.gitblame"
vscode "yzhang.markdown-all-in-one"
