org.mozilla.Thunderbird
com.spotify.Client
net.cozic.joplin_desktop
com.getpostman.Postman
com.logseq.Logseq
org.zotero.Zotero
org.filezillaproject.Filezilla
ch.protonmail.protonmail-bridge
com.protonvpn.www
md.obsidian.Obsidian
org.wireshark.Wireshark
org.openscad.OpenSCAD
org.gimp.GIMP
com.vscodium.codium
org.gnome.seahorse.Application
io.github.woelper.Oculante
com.hunterwittenborn.Celeste
com.rstudio.RStudio
org.kde.labplot
com.jgraph.drawio.desktop