tap "finestructure/tap"
tap "grishka/grishka"
tap "nikitabobko/tap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Swiss-army knife for Android testing and development
brew "adb-enhanced"
# Next-gen compiler infrastructure
brew "llvm"
# American Fuzzy Lop++
brew "afl++"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Backend processor for BibLaTeX
brew "biber"
# Object-file caching compiler wrapper
brew "ccache"
# Anti-virus software
brew "clamav"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Static analysis of C and C++ code
brew "cppcheck"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# USB programmer
brew "dfu-util"
# Load/unload environment variables based on $PWD
brew "direnv"
# .NET Core
brew "dotnet"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# Command-line fuzzy finder written in Go
brew "fzf"
# Git extension for versioning large files
brew "git-lfs"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Cross-platform Java Version Manager
brew "jabba"
# Sane PBXProj files
brew "kin"
# Anti-bikeshedding Kotlin linter with built-in formatter
brew "ktlint"
# Simple terminal UI for git commands
brew "lazygit"
# Sophisticated file transfer program
brew "lftp"
# Postgres C API library
brew "libpq", link: true
# YAML Parser
brew "libyaml"
# LTeX+ Language Server: maintained fork of LTeX Language Server
brew "ltex-ls-plus"
# Utility for directing compilation
brew "make"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Message broker implementing the MQTT protocol
brew "mosquitto"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql-client"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Open-source, cross-platform JavaScript runtime environment
brew "node@20"
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Development kit for the Java programming language
brew "openjdk@17"
# Development kit for the Java programming language
brew "openjdk@21"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Draw UML diagrams
brew "plantuml"
# Your Gateway to Embedded Software Development Excellence
brew "platformio"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# Python version management
brew "pyenv"
# File browser
brew "ranger"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Display and control your Android device
brew "scrcpy"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Shell Script Compiler
brew "shc"
# SOcket CAT: netcat on steroids
brew "socat"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# User interface to the TELNET protocol
brew "telnet"
# Display images in a terminal using block graphic characters
brew "terminalimageviewer"
# Free software distribution for the TeX typesetting system
brew "texlive"
# Programmatically correct mistyped console commands
brew "thefuck"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Image processing library
brew "vips"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Describe your project
brew "finestructure/tap/arena"
# Android SDK component
cask "android-platform-tools"
# Electronics prototyping platform
cask "arduino-ide"
# Web security testing toolkit
cask "burp-suite"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Visually compare and merge files
cask "diffmerge"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Note taking and to-do application with synchronisation capabilities
cask "joplin"
# Software for Logitech devices
cask "logi-options+"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Connect to your Android devices
cask "macdroid"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Open source implementation of Microsoft's .NET Framework
cask "mono-mdk-for-visual-studio"
# Unofficial Google Nearby Share app
# cask "neardrop"
# Command-line tools for Nordic nRF Semiconductors
cask "nordic-nrf-command-line-tools"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Programmable solid 3D CAD modeller
cask "openscad"
# Collaboration platform for API development
cask "postman"
# Client for Proton Drive
cask "proton-drive"
# VPN client focusing on security
cask "protonvpn"
# HTTP debugging proxy
cask "proxyman"
# G-code generator for 3D printers (RepRap, Makerbot, Ultimaker etc.)
cask "prusaslicer"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Software and Documentation pack for Segger J-Link debug probes
cask "segger-jlink"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# LaTeX editor
cask "texifier"
# Virtual machines UI using QEMU
cask "utm"
# Connect to Windows
cask "windows-app"
# Network protocol analyzer
cask "wireshark-app"
# Collect, organise, cite, and share research sources
cask "zotero"
