tap "homebrew/services"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Swiss-army knife for Android testing and development
brew "adb-enhanced"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Backend processor for BibLaTeX
brew "biber"
# Object-file caching compiler wrapper
brew "ccache"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# USB programmer
brew "dfu-util"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose", link: false
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Git extension for versioning large files
brew "git-lfs"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Sane PBXProj files
brew "kin"
# Simple terminal UI for git commands
brew "lazygit"
# YAML Parser
brew "libyaml"
# LTeX+ Language Server: maintained fork of LTeX Language Server
brew "ltex-ls-plus"
# Utility for directing compilation
brew "make"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql-client"
# Small build system for use with gyp or CMake
brew "ninja"
# Platform built on V8 to build network applications
brew "node@20"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Development kit for the Java programming language
brew "openjdk@17"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Draw UML diagrams
brew "plantuml"
# Your Gateway to Embedded Software Development Excellence
brew "platformio"
# Python version management
brew "pyenv"
# Display and control your Android device
brew "scrcpy"
# SOcket CAT: netcat on steroids
brew "socat"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# User interface to the TELNET protocol
brew "telnet"
# Free software distribution for the TeX typesetting system
brew "texlive"
# Programmatically correct mistyped console commands
brew "thefuck"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn", link: false
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Android SDK component
cask "android-platform-tools"
# Tools for the Android SDK
cask "android-sdk"
# Web security testing toolkit
cask "burp-suite"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Visually compare and merge files
cask "diffmerge"
# Online diagram software
cask "drawio"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Android file transfer
cask "openmtp"
# Programmable solid 3D CAD modeller
cask "openscad"
# Collaboration platform for API development
cask "postman"
# Client for Proton Drive
cask "proton-drive"
# Bridges Proton Mail to email clients supporting IMAP and SMTP protocols
cask "proton-mail-bridge"
# HTTP debugging proxy
cask "proxyman"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# LaTeX editor
cask "texifier"
# Virtual machines UI using QEMU
cask "utm"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Network protocol analyzer
cask "wireshark"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alexcvzz.vscode-sqlite"
vscode "angular.ng-template"
vscode "anilkumarum.compile-ts"
vscode "bierner.emojisense"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "espressif.esp-idf-extension"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "franneck94.vscode-typescript-extension-pack"
vscode "gruntfuggly.todo-tree"
vscode "gydunhn.javascript-essentials"
vscode "gydunhn.typescript-essentials"
vscode "gydunhn.vsc-essentials-core"
vscode "ibm.output-colorizer"
vscode "jebbs.plantuml"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "jock.svg"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "ltex-plus.vscode-ltex-plus"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mattpocock.ts-error-translator"
vscode "mkhl.direnv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-vscode.vscode-typescript-next"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-sqlite"
vscode "oderwat.indent-rainbow"
vscode "phil294.git-log--graph"
vscode "pinage404.bash-extension-pack"
vscode "prisma.prisma-insider"
vscode "qwtel.sqlite-viewer"
vscode "rail5.bashpp"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rintoj.json-organizer"
vscode "rogalmic.bash-debug"
vscode "rpinski.shebang-snippets"
vscode "sqlfluff.vscode-sqlfluff"
vscode "sswg.swift-lang"
vscode "timonwong.shellcheck"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tomi.xajssnippets"
vscode "tomi.xasnippets"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "valentjn.vscode-ltex"
vscode "vknabel.vscode-apple-swift-format"
vscode "vknabel.vscode-swiftformat"
vscode "waderyan.gitblame"
vscode "wingrunr21.vscode-ruby"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
