tap "finestructure/tap"
tap "grishka/grishka"
tap "nikitabobko/tap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Swiss-army knife for Android testing and development
brew "adb-enhanced"
# Next-gen compiler infrastructure
brew "llvm"
# American Fuzzy Lop++
brew "afl++"
# Core application library for C
brew "glib"
# Low-level library for pixel manipulation
brew "pixman"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Backend processor for BibLaTeX
brew "biber"
# Object-file caching compiler wrapper
brew "ccache"
# Anti-virus software
brew "clamav"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Static analysis of C and C++ code
brew "cppcheck"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# USB programmer
brew "dfu-util"
# Load/unload environment variables based on $PWD
brew "direnv"
# .NET Core
brew "dotnet"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Git extension for versioning large files
brew "git-lfs"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Development framework for multimedia applications
brew "gstreamer"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Cross-platform Java Version Manager
brew "jabba"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Sane PBXProj files
brew "kin"
# Anti-bikeshedding Kotlin linter with built-in formatter
brew "ktlint"
# Simple terminal UI for git commands
brew "lazygit"
# Sophisticated file transfer program
brew "lftp"
# Postgres C API library
brew "libpq", link: true
# General purpose TCP-IP emulator
brew "libslirp"
# YAML Parser
brew "libyaml"
# LTeX+ Language Server: maintained fork of LTeX Language Server
brew "ltex-ls-plus"
# Utility for directing compilation
brew "make"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Message broker implementing the MQTT protocol
brew "mosquitto"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql-client"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Draw UML diagrams
brew "plantuml"
# Your Gateway to Embedded Software Development Excellence
brew "platformio"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# Sound system for POSIX OSes
brew "pulseaudio"
# Python version management
brew "pyenv"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Display and control your Android device
brew "scrcpy"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Shell Script Compiler
brew "shc"
# Work with remote images registries
brew "skopeo"
# SOcket CAT: netcat on steroids
brew "socat"
# Audio processing library
brew "sound-touch"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Describe your project
brew "finestructure/tap/arena"
# Android SDK component
cask "android-platform-tools"
# Electronics prototyping platform
cask "arduino-ide"
# Web security testing toolkit
cask "burp-suite"
# Visually compare and merge files
cask "diffmerge"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# 3D parametric modeller
cask "freecad"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# CAD application
cask "librecad"
# Software for Logitech devices
cask "logi-options+"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Connect to your Android devices
cask "macdroid"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Mesh processing system
cask "meshlab"
# Open source implementation of Microsoft's .NET Framework
cask "mono-mdk-for-visual-studio"
# Command-line tools for Nordic nRF Semiconductors
cask "nordic-nrf-command-line-tools"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Programmable solid 3D CAD modeller
cask "openscad"
# Collaboration platform for API development
cask "postman"
# Client for Proton Drive
cask "proton-drive"
# VPN client focusing on security
cask "protonvpn"
# HTTP debugging proxy
cask "proxyman"
# G-code generator for 3D printers (RepRap, Makerbot, Ultimaker etc.)
cask "prusaslicer"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Software and Documentation pack for Segger J-Link debug probes
cask "segger-jlink"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# LaTeX editor
cask "texifier"
# Virtual machines UI using QEMU
cask "utm"
# Multimedia player
cask "vlc"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Network protocol analyzer
cask "wireshark-app"
# Collect, organise, cite, and share research sources
cask "zotero"
vscode "13xforever.language-x86-64-assembly"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alexcvzz.vscode-sqlite"
vscode "angular.ng-template"
vscode "anilkumarum.compile-ts"
vscode "anweber.httpbook"
vscode "anweber.vscode-httpyac"
vscode "bbenoist.doxygen"
vscode "bierner.emojisense"
vscode "bleastprogram.cpp-compiler"
vscode "cheshirekow.cmake-format"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cschlosser.doxdocgen"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "ddorch.codium-devcontainer"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "dreamcatcher45.podmanager"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "eclipse-cdt.serial-monitor"
vscode "efoerster.texlab"
vscode "ericsia.pythonsnippets3"
vscode "esbenp.prettier-vscode"
vscode "espressif.esp-idf-extension"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "franneck94.c-cpp-runner"
vscode "franneck94.vscode-c-cpp-config"
vscode "franneck94.vscode-c-cpp-dev-extension-pack"
vscode "franneck94.vscode-typescript-extension-pack"
vscode "fwcd.kotlin"
vscode "gicentre.markdown-preview-enhanced-with-litvis"
vscode "gruntfuggly.todo-tree"
vscode "guyutongxue.cpp-reference"
vscode "gydunhn.javascript-essentials"
vscode "gydunhn.typescript-essentials"
vscode "gydunhn.vsc-essentials-core"
vscode "ibm.output-colorizer"
vscode "james-yu.latex-workshop"
vscode "jbenden.c-cpp-flylint"
vscode "jebbs.plantuml"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "jeffersonqin.latex-snippets-jeff"
vscode "jock.svg"
vscode "kotlin-darcula-syntax.kotlin-darcula-syntax"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "ltex-plus.vscode-ltex-plus"
vscode "mads-hartmann.bash-ide-vscode"
vscode "magicstack.magicpython"
vscode "marus25.cortex-debug"
vscode "mathiasfrohlich.kotlin"
vscode "mattpocock.ts-error-translator"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mcu-debug.peripheral-viewer"
vscode "mcu-debug.rtos-views"
vscode "mjpvs.latex-previewer"
vscode "mkhl.direnv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.vscode-typescript-next"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-sqlite"
vscode "oderwat.indent-rainbow"
vscode "phil294.git-log--graph"
vscode "philosowaffle.openapi-designer"
vscode "pinage404.bash-extension-pack"
vscode "pokey.parse-tree"
vscode "postman.postman-for-vscode"
vscode "prisma.prisma-insider"
vscode "project-accelerate.shared-state-store"
vscode "qwtel.sqlite-viewer"
vscode "rail5.bashpp"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redocly.openapi-vs-code"
vscode "rintoj.json-organizer"
vscode "rogalmic.bash-debug"
vscode "rpinski.shebang-snippets"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "sndst00m.vscode-native-svg-preview"
vscode "sr-team.clang-tidy-sr-team-fork"
vscode "sr-team.vscode-clangd-cmake"
vscode "sr-team.vscode-cpp-file-renamer"
vscode "sswg.swift-lang"
vscode "swiftstream.swiftstream"
vscode "tecosaur.latex-utilities"
vscode "timonwong.shellcheck"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tomi.xajssnippets"
vscode "tomi.xasnippets"
vscode "torn4dom4n.latex-support"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vknabel.vscode-apple-swift-format"
vscode "vknabel.vscode-swiftformat"
vscode "waderyan.gitblame"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
