anweber.vscode-httpyac
davidanson.vscode-markdownlint
ddorch.codium-devcontainer
dreamcatcher45.podmanager
efoerster.texlab
esbenp.prettier-vscode
espressif.esp-idf-extension
foxundermoon.shell-format
hangxingliu.vscode-systemd-support
james-yu.latex-workshop
jeanp413.open-remote-ssh
jebbs.plantuml
jeff-hykin.better-shellscript-syntax
jeffersonqin.latex-snippets-jeff
llvm-vs-code-extensions.vscode-clangd
lordimmaculate.platformio-ide
ltex-plus.vscode-ltex-plus
mads-hartmann.bash-ide-vscode
mjpvs.latex-previewer
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.python
ms-python.vscode-python-envs
ms-vscode.cmake-tools
ms-vscode.hexeditor
phil294.git-log--graph
philosowaffle.openapi-designer
pinage404.bash-extension-pack
redhat.vscode-xml
repreng.csv
rpinski.shebang-snippets
shd101wyy.markdown-preview-enhanced
sndst00m.vscode-native-svg-preview
sr-team.clang-tidy-sr-team-fork
tecosaur.latex-utilities
timonwong.shellcheck
torn4dom4n.latex-support
waderyan.gitblame
yzhang.markdown-all-in-one
