13xforever.language-x86-64-assembly
aaron-bond.better-comments
alefragnani.bookmarks
alexcvzz.vscode-sqlite
angular.ng-template
anilkumarum.compile-ts
bbenoist.doxygen
bierner.emojisense
bleastprogram.cpp-compiler
cheshirekow.cmake-format
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
circuitdojo.zephyr-tools
cschlosser.doxdocgen
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
devsense.composer-php-vscode
devsense.intelli-php-vscode
devsense.phptools-vscode
devsense.profiler-php-vscode
dreamcatcher45.podmanager
dsznajder.es7-react-js-snippets
eamodio.gitlens
eclipse-cdt.serial-monitor
efoerster.texlab
ericsia.pythonsnippets3
esbenp.prettier-vscode
espressif.esp-idf-extension
firefox-devtools.vscode-firefox-debug
formulahendry.code-runner
foxundermoon.shell-format
franneck94.c-cpp-runner
franneck94.vscode-c-cpp-config
franneck94.vscode-c-cpp-dev-extension-pack
franneck94.vscode-typescript-extension-pack
fwcd.kotlin
gruntfuggly.todo-tree
guyutongxue.cpp-reference
gydunhn.javascript-essentials
gydunhn.typescript-essentials
gydunhn.vsc-essentials-core
ibm.output-colorizer
james-yu.latex-workshop
jbenden.c-cpp-flylint
jebbs.plantuml
jeff-hykin.better-cpp-syntax
jeff-hykin.better-shellscript-syntax
jeffersonqin.latex-snippets-jeff
jock.svg
kotlin-darcula-syntax.kotlin-darcula-syntax
llvm-vs-code-extensions.vscode-clangd
ltex-plus.vscode-ltex-plus
mads-hartmann.bash-ide-vscode
magicstack.magicpython
marus25.cortex-debug
mathiasfrohlich.kotlin
mattpocock.ts-error-translator
mcu-debug.debug-tracker-vscode
mcu-debug.memory-view
mcu-debug.peripheral-viewer
mcu-debug.rtos-views
mjpvs.latex-previewer
mkhl.direnv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-vscode.cmake-tools
ms-vscode.hexeditor
ms-vscode.vscode-typescript-next
mtxr.sqltools
mtxr.sqltools-driver-sqlite
oderwat.indent-rainbow
phil294.git-log--graph
philosowaffle.openapi-designer
pinage404.bash-extension-pack
pokey.parse-tree
postman.postman-for-vscode
prisma.prisma-insider
project-accelerate.shared-state-store
qwtel.sqlite-viewer
rail5.bashpp
redhat.java
redhat.vscode-xml
redocly.openapi-vs-code
rintoj.json-organizer
rogalmic.bash-debug
rpinski.shebang-snippets
shd101wyy.markdown-preview-enhanced
shopify.ruby-lsp
sndst00m.vscode-native-svg-preview
sqlfluff.vscode-sqlfluff
sr-team.clang-tidy-sr-team-fork
sr-team.vscode-clangd-cmake
sr-team.vscode-cpp-file-renamer
sswg.swift-lang
swiftstream.swiftstream
tecosaur.latex-utilities
timonwong.shellcheck
tombonnike.vscode-status-bar-format-toggle
tomi.xajssnippets
tomi.xasnippets
torn4dom4n.latex-support
twxs.cmake
usernamehw.errorlens
vadimcn.vscode-lldb
vknabel.vscode-apple-swift-format
vknabel.vscode-swiftformat
waderyan.gitblame
xabikos.javascriptsnippets
yoavbls.pretty-ts-errors
yzhang.markdown-all-in-one
