# Base / shell / cli
zsh
vim
neovim
fzf
ripgrep
bat
wget
which
tree
w3m
ranger
xclip
xsel
socat

# Dev
base-devel
gcc
make
cmake
cmake-extras
ccache
cppcheck
ninja
llvm
android-tools
afl++
git-lfs
jdk-openjdk
ktlint
lazygit
nvm
pyenv
plantuml
pandoc
podman
podman-compose
scrcpy
texlive-basic
texlive-langenglish
texlive-langgerman
texlive-bibtexextra
texlive-xetex
texlive-luatex
texlive-latex
texlive-latexrecommended
texlive-fontsrecommended
texlive-doc
crun
thefuck
ollama
yarn
r

# Desktop / apps
drawio-desktop
gimp
firefox
openscad
obsidian
wireshark-qt
thunderbird
protonmail-bridge
proton-vpn-gtk-app
clamav
manjaro-printer
system-config-printer
filezilla
labplot
wine
winetricks
cups
nftables
iptables-nft